# RemoveFilter Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..RemoveFilter Method
ScheduleDefinition Class See Also
---
Removes a filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void RemoveFilter(
	int index
)
```

Visual Basic
---
```text
Public Sub RemoveFilter ( _
	index As Integer _
)
```

Visual C++
---
```text
public:
void RemoveFilter(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The index of the filter to remove.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | index is not a valid filter index. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This ScheduleDefinition does not support filters. |

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace